import React from "react";

function Login() {
  return (
    <main className="flex flex-col lg:flex-row">
      <section className="flex flex-col gap-4 p-8 text-white bg-primary lg:order-2 lg:w-1/2 lg:justify-center lg:items-center lg:min-h-screen">
        <h2 className="text-xl font-bold text-center">فروشگاه گیفت کارت</h2>
        <p className="leading-loose">
          اولین فروشگاه خرید گیفت کارت اپل، گوگل پلی، استیم، پلی استیشن و ...
        </p>
      </section>
      <section className="flex flex-col w-full max-w-md gap-8 p-6 mx-auto mb-12 lg:max-w-screen-2xl lg:px-12 xl:px-24 lg:order-1 lg:w-1/2 lg:justify-center">
        <h4 className="mb-12 font-bold text-center">ورود به حساب کاربری</h4>
        <form action="" className="flex flex-col gap-8">
          <div className="relative p-3 px-6 border-[1px] rounded-sm flex items-center gap-2">
            <label className="absolute -top-4 right-5 bg-[#FAFAFE] p-1 text-sm">
              ایمیل
            </label>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              viewBox="0 0 16 16"
              fill="none"
            >
              <path
                d="M11.334 14.1666H4.66732C2.23398 14.1666 0.833984 12.7666 0.833984 10.3333V5.66659C0.833984 3.23325 2.23398 1.83325 4.66732 1.83325H11.334C13.7673 1.83325 15.1673 3.23325 15.1673 5.66659V10.3333C15.1673 12.7666 13.7673 14.1666 11.334 14.1666ZM4.66732 2.83325C2.76065 2.83325 1.83398 3.75992 1.83398 5.66659V10.3333C1.83398 12.2399 2.76065 13.1666 4.66732 13.1666H11.334C13.2407 13.1666 14.1673 12.2399 14.1673 10.3333V5.66659C14.1673 3.75992 13.2407 2.83325 11.334 2.83325H4.66732Z"
                fill="#ACACAC"
              />
              <path
                d="M7.9992 8.57998C7.4392 8.57998 6.87254 8.40665 6.4392 8.05331L4.35253 6.38665C4.1392 6.21331 4.0992 5.89998 4.27254 5.68665C4.44587 5.47331 4.75921 5.43332 4.97254 5.60665L7.0592 7.27332C7.56587 7.67998 8.42586 7.67998 8.93253 7.27332L11.0192 5.60665C11.2325 5.43332 11.5525 5.46665 11.7192 5.68665C11.8925 5.89998 11.8592 6.21998 11.6392 6.38665L9.55254 8.05331C9.12587 8.40665 8.5592 8.57998 7.9992 8.57998Z"
                fill="#ACACAC"
              />
            </svg>
            <input
              type="email"
              placeholder="ایمیل خود را وارد کنید."
              className="relative w-full bg-transparent outline-none placeholder:text-sm"
            />
          </div>
          <div className="relative p-3 px-6 border-[1px] rounded-sm flex items-center gap-2">
            <label className="absolute -top-4 right-5 bg-[#FAFAFE] p-1 text-sm">
              رمز عبور
            </label>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              viewBox="0 0 16 16"
              fill="none"
            >
              <path
                d="M12 7.16671C11.7267 7.16671 11.5 6.94004 11.5 6.66671V5.33337C11.5 3.23337 10.9067 1.83337 8 1.83337C5.09333 1.83337 4.5 3.23337 4.5 5.33337V6.66671C4.5 6.94004 4.27333 7.16671 4 7.16671C3.72667 7.16671 3.5 6.94004 3.5 6.66671V5.33337C3.5 3.40004 3.96667 0.833374 8 0.833374C12.0333 0.833374 12.5 3.40004 12.5 5.33337V6.66671C12.5 6.94004 12.2733 7.16671 12 7.16671Z"
                fill="#ACACAC"
              />
              <path
                d="M8.00065 12.8333C6.80732 12.8333 5.83398 11.86 5.83398 10.6667C5.83398 9.47333 6.80732 8.5 8.00065 8.5C9.19398 8.5 10.1673 9.47333 10.1673 10.6667C10.1673 11.86 9.19398 12.8333 8.00065 12.8333ZM8.00065 9.5C7.36065 9.5 6.83398 10.0267 6.83398 10.6667C6.83398 11.3067 7.36065 11.8333 8.00065 11.8333C8.64065 11.8333 9.16732 11.3067 9.16732 10.6667C9.16732 10.0267 8.64065 9.5 8.00065 9.5Z"
                fill="#ACACAC"
              />
              <path
                d="M11.334 15.1666H4.66732C1.72732 15.1666 0.833984 14.2733 0.833984 11.3333V9.99996C0.833984 7.05996 1.72732 6.16663 4.66732 6.16663H11.334C14.274 6.16663 15.1673 7.05996 15.1673 9.99996V11.3333C15.1673 14.2733 14.274 15.1666 11.334 15.1666ZM4.66732 7.16663C2.28065 7.16663 1.83398 7.61996 1.83398 9.99996V11.3333C1.83398 13.7133 2.28065 14.1666 4.66732 14.1666H11.334C13.7207 14.1666 14.1673 13.7133 14.1673 11.3333V9.99996C14.1673 7.61996 13.7207 7.16663 11.334 7.16663H4.66732Z"
                fill="#ACACAC"
              />
            </svg>
            <input
              type="password"
              placeholder="رمز خود را وارد کنید."
              className="relative w-full bg-transparent outline-none placeholder:text-sm"
            />
          </div>
          <div className="relative p-3 px-6 border-[1px] rounded-sm flex items-center gap-2">
            <label className="absolute -top-4 right-5 bg-[#FAFAFE] p-1 text-sm">
              کد امنیتی
            </label>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="16"
              viewBox="0 0 16 16"
              fill="none"
            >
              <path
                d="M1.33398 6.50004C1.06065 6.50004 0.833984 6.27337 0.833984 6.00004V4.33337C0.833984 2.40004 2.40732 0.833374 4.33398 0.833374H6.00065C6.27398 0.833374 6.50065 1.06004 6.50065 1.33337C6.50065 1.60671 6.27398 1.83337 6.00065 1.83337H4.33398C2.95398 1.83337 1.83398 2.95337 1.83398 4.33337V6.00004C1.83398 6.27337 1.60732 6.50004 1.33398 6.50004Z"
                fill="#ACACAC"
              />
              <path
                d="M14.6667 6.50004C14.3933 6.50004 14.1667 6.27337 14.1667 6.00004V4.33337C14.1667 2.95337 13.0467 1.83337 11.6667 1.83337H10C9.72667 1.83337 9.5 1.60671 9.5 1.33337C9.5 1.06004 9.72667 0.833374 10 0.833374H11.6667C13.5933 0.833374 15.1667 2.40004 15.1667 4.33337V6.00004C15.1667 6.27337 14.94 6.50004 14.6667 6.50004Z"
                fill="#ACACAC"
              />
              <path
                d="M11.666 15.1666H10.666C10.3927 15.1666 10.166 14.94 10.166 14.6666C10.166 14.3933 10.3927 14.1666 10.666 14.1666H11.666C13.046 14.1666 14.166 13.0466 14.166 11.6666V10.6666C14.166 10.3933 14.3927 10.1666 14.666 10.1666C14.9393 10.1666 15.166 10.3933 15.166 10.6666V11.6666C15.166 13.6 13.5927 15.1666 11.666 15.1666Z"
                fill="#ACACAC"
              />
              <path
                d="M6.00065 15.1667H4.33398C2.40732 15.1667 0.833984 13.6 0.833984 11.6667V10C0.833984 9.72667 1.06065 9.5 1.33398 9.5C1.60732 9.5 1.83398 9.72667 1.83398 10V11.6667C1.83398 13.0467 2.95398 14.1667 4.33398 14.1667H6.00065C6.27398 14.1667 6.50065 14.3933 6.50065 14.6667C6.50065 14.94 6.27398 15.1667 6.00065 15.1667Z"
                fill="#ACACAC"
              />
              <path
                d="M9.33268 12.1667H6.66602C5.05268 12.1667 4.16602 11.28 4.16602 9.66671V6.33337C4.16602 4.72004 5.05268 3.83337 6.66602 3.83337H9.33268C10.946 3.83337 11.8327 4.72004 11.8327 6.33337V9.66671C11.8327 11.28 10.946 12.1667 9.33268 12.1667ZM6.66602 4.83337C5.61268 4.83337 5.16602 5.28004 5.16602 6.33337V9.66671C5.16602 10.72 5.61268 11.1667 6.66602 11.1667H9.33268C10.386 11.1667 10.8327 10.72 10.8327 9.66671V6.33337C10.8327 5.28004 10.386 4.83337 9.33268 4.83337H6.66602Z"
                fill="#ACACAC"
              />
              <path
                d="M12.6673 8.5H3.33398C3.06065 8.5 2.83398 8.27333 2.83398 8C2.83398 7.72667 3.06065 7.5 3.33398 7.5H12.6673C12.9407 7.5 13.1673 7.72667 13.1673 8C13.1673 8.27333 12.9407 8.5 12.6673 8.5Z"
                fill="#ACACAC"
              />
            </svg>
            <input
              type="text"
              placeholder="کد زیر را به انگلیسی وارد کنید."
              className="relative w-full bg-transparent outline-none placeholder:text-xs"
            />
          </div>
          <div className="flex gap-4">
            <img src="../public/assets/images/captcha.png" alt="" />
            <div className="flex items-center gap-2 text-[#717171] text-xs">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
              >
                <path d="M2.59102 13.7V17.8666V13.7Z" fill="#717171" />
                <path
                  d="M18.3327 9.99996C18.3327 14.6 14.5993 18.3333 9.99935 18.3333C5.39935 18.3333 2.59102 13.7 2.59102 13.7M2.59102 13.7H6.35768M2.59102 13.7V17.8666M1.66602 9.99996C1.66602 5.39996 5.36602 1.66663 9.99935 1.66663C15.5577 1.66663 18.3327 6.29996 18.3327 6.29996M18.3327 6.29996V2.13329M18.3327 6.29996H14.6327"
                  stroke="#717171"
                  strokeWidth="1.5"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                />
              </svg>
              بارگذاری مجدد
            </div>
          </div>
          <button
            type="submit"
            className="p-3 px-12 text-center text-white rounded-sm bg-primary lg:w-3/4 lg:mx-auto"
          >
            ورود به حساب کاربری
          </button>
        </form>

        <a href="#" className="block mt-6 text-secondary">
          فراموشی کلمه عبور
        </a>
        <span className="block">
          حساب کاربری ندارید؟
          <a href="#" className="text-primary">
            ساخت حساب کاربری جدید
          </a>
        </span>
      </section>
    </main>
  );
}

export default Login;
